//  Подсистема "Технология верстки статьи для Infostart"
//	Автор: Калякин Андрей Г.
//  https://github.com/KalyakinAG/layout2is
//  https://infostart.ru/1c/tools/2145718/

#Область ОписаниеПеременных

&НаКлиенте
Перем 
	ГраницаВыделения
;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	showdown_min_js = ОбработкаОбъект.ПолучитьМакет("showdown_min_js");
	АдресJS = ПоместитьВоВременноеХранилище(showdown_min_js);
	MD2HTML_html = ОбработкаОбъект.ПолучитьМакет("MD2Clipboard_html");
	АдресHTML = ПоместитьВоВременноеХранилище(MD2HTML_html);
	Сведения = ОбработкаОбъект.СведенияОВнешнейОбработке();
	Заголовок = СтрШаблон("%1, вер. %2", Сведения.Наименование, Сведения.Версия);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПутьJS = ПолучитьИмяВременногоФайла(".js");
	showdown_min_js = ПолучитьИзВременногоХранилища(АдресJS);
	showdown_min_js.Записать(ПутьJS);
	MD2HTML_html = ПолучитьИзВременногоХранилища(АдресHTML);
	ТекстHTML = СтрЗаменить(MD2HTML_html.ПолучитьТекст(), "showdown.min.js", ПутьJS);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКПроектуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.Заголовок = "Каталог проекта";
	Если НЕ ДиалогВыбораКаталога.Выбрать() Тогда
		Возврат;
	КонецЕсли;
    ПутьКПроекту = ДиалогВыбораКаталога.Каталог;
    Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура codebeautifyНажатие(Элемент)
	ЗапуститьПриложение("https://codebeautify.org/markdown-to-html");
КонецПроцедуры

&НаКлиенте
Процедура ПутьКПроектуПриИзменении(Элемент)
	Прочитать();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПрочитать(Команда)
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПутьИзHTML(Команда)
	ОбработчикЗавершения = Новый ОписаниеОповещения("ОпределитьПутиСсылок", ЭтотОбъект);
	ОткрытьФормуВладельца("ImageLinkExtractor",, ЭтотОбъект,,,, ОбработчикЗавершения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаменитьПуть(Команда)
	Для Каждого Изображение Из Изображения Цикл
		Если ПустаяСтрока(Изображение.ИсходныйПуть) ИЛИ ПустаяСтрока(Изображение.Путь) Тогда
			Продолжить;
		КонецЕсли;
		ТекстMD = СтрЗаменить(ТекстMD, Изображение.Путь, Изображение.ИсходныйПуть);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьИзображения(Команда)
	Изображения.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаВосстановитьНастройки(Команда)
	ПрочитатьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьНастройки(Команда)
	Настройки = Новый Структура;
	Настройки.Вставить("Изображения", СписокИзображений());
	ЗаписатьДанныеВФайлJSON(Настройки, ПутьКПроекту + "\layout2is.json"); 
КонецПроцедуры

&НаСервере
Процедура КомандаНайтиСсылкиНаСервере()
	Словарь = Новый Соответствие;
	Для Каждого Изображение Из Изображения Цикл
		Словарь[Изображение.Имя] = Изображение;
	КонецЦикла;
	РегулярноеВыражение = РегулярноеВыражениеПоискСсылок();
	Результаты = СтрНайтиВсеПоРегулярномуВыражению(ТекстMD, РегулярноеВыражение, Истина, Истина);
	Для Каждого Результат Из Результаты Цикл
		Группы = Результат.ПолучитьГруппы();
		ИсходныйПуть = Группы[1].Значение;
		СоставПути = СтрРазделить(ИсходныйПуть, "/");
		Имя = СоставПути[СоставПути.ВГраница()];
		Изображение = Словарь[Имя];
		Если Изображение = Неопределено Тогда
			Изображение = Изображения.Добавить();
			Изображение.Имя = Имя;
			Словарь[Изображение.Имя] = Изображение;
		КонецЕсли;
		Изображение.Наименование = Группы[0].Значение;
		Изображение.ИсходныйПуть = ИсходныйПуть;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаНайтиСсылки(Команда)
	КомандаНайтиСсылкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаMD2HTML(Команда)
	ОбработчикЗавершения = Новый ОписаниеОповещения("СкопироватьHTMLВБуферОбмена", ЭтотОбъект);
	ОткрытьФормуВладельца("MD2HTML", Новый Структура("ТекстMD", ТекстMD), ЭтотОбъект,,,, ОбработчикЗавершения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура КомандаНайтиВТексте(Команда)
	Изображение = Изображения.НайтиПоИдентификатору(Элементы.Изображения.ТекущаяСтрока);
	Если НайтиИВыделитьВТекстеMD(Изображение.ИсходныйПуть) ИЛИ НайтиИВыделитьВТекстеMD(Изображение.Путь) Тогда
		Возврат;
	КонецЕсли;
	ПоказатьПредупреждение(, "Ссылка на изображение не найдена в тексте.");
КонецПроцедуры

&НаКлиенте
Процедура КомандаАвтоформат(Команда)
	ДобавитьОглавление();
	ДобавитьПодписи();
	ЗаменитьТабуляцию();
	ЗаменитьВыбранныйЯзык();
	ЗаменитьСсылки();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкопироватьHTML(Команда)
	Document = Элементы.ПолеHTML.Документ;
	htmlCode = Document.defaultView.convert(ТекстMD);
    Document.defaultView.copyToClipboard(htmlCode);
	ПоказатьОповещениеПользователя("HTML код скопирован", , "Информация");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСМассивом

&НаСервере
Функция ТаблицаЗначенийВМассив(ТаблицаЗначений)
	
	Массив = Новый Массив();
	СтруктураСтрокой = "";
	НужнаЗапятая = Ложь;
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая = Истина;
	КонецЦикла;
	Для Каждого Строка Из ТаблицаЗначений Цикл
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Массив.Добавить(НоваяСтрока);
	КонецЦикла;
	Возврат Массив;

КонецФункции

//  slice
&НаКлиентеНаСервереБезКонтекста
Функция Срез(Элементы, НижняяГраница = 0, Знач ВерхняяГраница = Неопределено, Шаг = 1)
	Если ВерхняяГраница = Неопределено Тогда
		ВерхняяГраница = Элементы.Количество();
	КонецЕсли;
	Результат = Новый Массив;
	Индекс = НижняяГраница;
	Пока Индекс < ВерхняяГраница Цикл
		Результат.Добавить(Элементы[Индекс]);
		Индекс = Индекс + Шаг;
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Дополняет массив МассивПриемник значениями из массива МассивИсточник.
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения.
//  МассивИсточник - Массив - массив значений для заполнения.
//  ТолькоУникальныеЗначения - Булево - если истина, то в массив будут включены только уникальные значения.
//
&НаКлиентеНаСервереБезКонтекста
Функция ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения = Ложь, НижняяГраница = 0, Знач ВерхняяГраница = Неопределено, Шаг = 1)
	Если ВерхняяГраница = Неопределено Тогда
		ВерхняяГраница = МассивИсточник.Количество();
	КонецЕсли;
	Индекс = НижняяГраница;
	Если ТолькоУникальныеЗначения Тогда
		УникальныеЗначения = Новый Соответствие;
		Для Каждого Значение Из МассивПриемник Цикл
			УникальныеЗначения.Вставить(Значение, Истина);
		КонецЦикла;
		Пока Индекс < ВерхняяГраница Цикл
			Значение = МассивИсточник[Индекс];
			Если УникальныеЗначения[Значение] = Неопределено Тогда
				МассивПриемник.Добавить(Значение);
				УникальныеЗначения.Вставить(Значение, Истина);
			КонецЕсли;
			Индекс = Индекс + Шаг;
		КонецЦикла;
	Иначе
		Пока Индекс < ВерхняяГраница Цикл
			МассивПриемник.Добавить(МассивИсточник[Индекс]);
			Индекс = Индекс + Шаг;
		КонецЦикла;
	КонецЕсли;
	Возврат МассивПриемник;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Следующий(Индекс, Элемент, Элементы, Шаг = 1)
	Если Индекс = Неопределено Тогда
		Индекс = 0;
	Иначе
		Индекс = Индекс + Шаг;
	КонецЕсли;
	Если Индекс > Элементы.ВГраница() Тогда
		Возврат Ложь;
	КонецЕсли;
	Элемент = Элементы[Индекс];
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область РаботаСJSON

&НаКлиенте
Функция ПрочитатьДанныеИзФайлаJSON(ИмяФайла)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл(ИмяФайла, "UTF-8");
	Данные = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	Возврат Данные;
КонецФункции

&НаКлиенте
Процедура ЗаписатьДанныеВФайлJSON(Данные, ИмяФайла)
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ИмяФайла, "UTF-8", , ПараметрыJSON);
	ЗаписатьJSON(ЗаписьJSON, Данные);
	ЗаписьJSON.Закрыть();
КонецПроцедуры

Функция JSONВОбъект(СтрокаJSON, ПрочитатьВСоответствие = Ложь)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Возврат ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
КонецФункции

#КонецОбласти

#Область РаботаСТекстом

&НаКлиенте
Функция НовыйГраница(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки)
	Возврат Новый Структура("НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки", НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
КонецФункции

&НаКлиенте
Функция ЭтоПустаяГраница(Граница)
	Возврат Граница = Неопределено ИЛИ Граница.НачалоСтроки = Граница.КонецСтроки И Граница.НачалоКолонки = Граница.КонецКолонки;
КонецФункции

&НаКлиенте
Процедура УстановитьГраницу(ПолеТекста, ГраницаВыделения)
	ПолеТекста.УстановитьГраницыВыделения(ГраницаВыделения.НачалоСтроки, ГраницаВыделения.НачалоКолонки, ГраницаВыделения.КонецСтроки, ГраницаВыделения.КонецКолонки);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьГраницу(ПолеТекста)
	Перем НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки;
	ПолеТекста.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
	Возврат НовыйГраница(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки); 
КонецФункции

&НаКлиенте
Функция НайтиГраницуТекста(Текст, Подстрока, ГраницаНачала = Неопределено)
	Строки = СтрРазделить(Текст, Символы.ПС);
	Если ГраницаНачала = Неопределено Тогда
		НачальныйИндекс = 0;
		НачалоКолонкиПоиска = 1;
	Иначе
		НачальныйИндекс = ГраницаНачала.КонецСтроки - 1;
		НачалоКолонкиПоиска = ГраницаНачала.КонецКолонки;
	КонецЕсли;
	Для Индекс = НачальныйИндекс По Строки.ВГраница() Цикл
		Строка = Строки[Индекс];
		Если Индекс = НачальныйИндекс Тогда
			Если НачалоКолонкиПоиска > СтрДлина(Строка) Тогда
				Продолжить;
			КонецЕсли;
			НачалоКолонки = СтрНайти(Строка, Подстрока, , НачалоКолонкиПоиска);
		Иначе
			НачалоКолонки = СтрНайти(Строка, Подстрока);
		КонецЕсли;
		Если НачалоКолонки > 0 Тогда
			КонецКолонки = НачалоКолонки + СтрДлина(Подстрока); 
			НомерСтроки = Индекс + 1;
			Возврат НовыйГраница(НомерСтроки, НачалоКолонки, НомерСтроки, КонецКолонки);
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Функция НайтиИВыделитьВТекстеMD(СтрокаПоиска)
	ГраницаНачала = ПолучитьГраницу(Элементы.ТекстMD);
	Если ГраницаНачала.КонецКолонки > 1 ИЛИ ГраницаНачала.КонецСтроки > 1 Тогда
		ГраницаВыделения = НайтиГраницуТекста(ТекстMD, СтрокаПоиска, ГраницаНачала);
		Если ЭтоПустаяГраница(ГраницаВыделения) Тогда
			ГраницаВыделения = НайтиГраницуТекста(ТекстMD, СтрокаПоиска);
		КонецЕсли;
	Иначе
		ГраницаВыделения = НайтиГраницуТекста(ТекстMD, СтрокаПоиска);
	КонецЕсли;
	Если ЭтоПустаяГраница(ГраницаВыделения) Тогда
		Возврат Ложь;
	КонецЕсли;
	УстановитьГраницу(Элементы.ТекстMD, ГраницаВыделения);
	ТекущийЭлемент = Элементы.ТекстMD;
	Возврат Истина;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РегулярноеВыражениеПоискСсылок()
	РегулярноеВыражение = "\!\[(.*)\]\(((?:\/images\/|https:\/\/infostart\.ru\/)()[^)\s]+)\)";
	Возврат РегулярноеВыражение;
КонецФункции

// Формирует строку повторяющихся символов заданной длины.
//
// Параметры:
//  Символ      - Строка - символ, из которого будет формироваться строка.
//  ДлинаСтроки - Число  - требуемая длина результирующей строки.
//
// Возвращаемое значение:
//  Строка - строка, состоящая из повторяющихся символов.
//
&НаКлиентеНаСервереБезКонтекста
Функция СформироватьСтрокуСимволов(Знач Символ, Знач ДлинаСтроки)
	
	Результат = "";
	Для Счетчик = 1 По ДлинаСтроки Цикл
		Результат = Результат + Символ;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Автоформат

&НаКлиенте
Процедура ДобавитьОглавление()
	Перем Индекс, ИндексСтрокиTOC, Строка, Заголовок;
	Заголовки = Новый Массив;
	Строки = СтрРазделить(ТекстMD, Символы.ПС);
	МинУровень = 9;
	Пока Следующий(Индекс, Строка, Строки) Цикл
		Если ИндексСтрокиTOC = Неопределено Тогда
			Если Строка = "[TOC]" Тогда
				ИндексСтрокиTOC = Индекс;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		Если НЕ СтрНачинаетсяС(Строка, "#") Тогда
			Продолжить;
		КонецЕсли;
		Уровень = ПолучитьУровень(Строка);
		МинУровень = Мин(МинУровень, Уровень);
		Заголовок = Прав(Строка, СтрДлина(Строка) - Уровень - 1);
		Заголовки.Добавить(Новый Структура("Заголовок, Уровень", Заголовок, Уровень));
	КонецЦикла;
	Если ИндексСтрокиTOC = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Заголовки) Тогда
		Возврат;
	КонецЕсли;
	Список = Новый Массив;
	Список.Добавить("### Оглавление:");
	Для Каждого ЭлементЗаголовка Из Заголовки Цикл
		Отступ = СформироватьСтрокуСимволов(Символы.Таб, ЭлементЗаголовка.Уровень - МинУровень);
		Ссылка = СтрСоединить(СтрРазделить(НРег(ЭлементЗаголовка.Заголовок), " !*_():\/%,-""", Ложь), "-"); 
		Список.Добавить(СтрШаблон("%1- [%2](#%3)", Отступ, ЭлементЗаголовка.Заголовок, Ссылка)); 
	КонецЦикла;
	
	НовыеСтроки = Новый Массив;
	ДополнитьМассив(НовыеСтроки, Строки, , , ИндексСтрокиTOC);
	ДополнитьМассив(НовыеСтроки, Список);
	ДополнитьМассив(НовыеСтроки, Строки, , ИндексСтрокиTOC + 1);
	
	ТекстMD = СтрСоединить(НовыеСтроки, Символы.ПС);
КонецПроцедуры

&НаСервере
Процедура ДобавитьПодписи()
	Перем Индекс, Строка, Наименование;
	СловарьИсходныйПуть = Новый Соответствие;
	СловарьПуть = Новый Соответствие;
	Для Каждого Изображение Из Изображения Цикл
		СловарьИсходныйПуть[Изображение.ИсходныйПуть] = Изображение;
		СловарьПуть[Изображение.Путь] = Изображение;
	КонецЦикла;
	Строки = СтрРазделить(ТекстMD, Символы.ПС);
	РегулярноеВыражение = РегулярноеВыражениеПоискСсылок();
	Пока Следующий(Индекс, Строка, Строки) Цикл
		Если СтрНачинаетсяС(Строка, "Код 1С. ")
			ИЛИ СтрНачинаетсяС(Строка, "Запрос 1С. ")
			ИЛИ СтрНачинаетсяС(Строка, "Таблица. ")
			ИЛИ СтрНачинаетсяС(Строка, "Пример. ")
		Тогда
			НаименованиеHTML = СтрШаблон("<p><span style=""font-size:9pt; font-family:'Arial'; color:#5b9bd5""><b>%1</b></span></p>", Строка);
			Строки[Индекс] = НаименованиеHTML;
			Продолжить;
		КонецЕсли;
		Если СтрНачинаетсяС(Строка, "![") Тогда
			РезультатПоиска = СтрНайтиПоРегулярномуВыражению(Строка, РегулярноеВыражение, , , , Истина, Ложь);
			Если РезультатПоиска.НачальнаяПозиция = 0 Тогда
				Продолжить;
			КонецЕсли;
			Группы = РезультатПоиска.ПолучитьГруппы();
			Путь = Группы[1].Значение;
			ИзображениеИсходныйПуть = СловарьИсходныйПуть[Путь];
			ИзображениеПуть = СловарьПуть[Путь];
			Изображение = ?(ИзображениеПуть = Неопределено, ИзображениеИсходныйПуть, ИзображениеПуть);
			Если Изображение = Неопределено Тогда
				Наименование = Группы[0].Значение;
			Иначе
				Наименование = Изображение.Наименование;
			КонецЕсли;
			НаименованиеHTML = СтрШаблон("<p><span style=""font-size:9pt; font-family:'Arial'; color:#5b9bd5""><b>%1</b></span></p>", Наименование);
			Строки[Индекс] = НаименованиеHTML + Символы.ПС + Символы.ПС + Строка;
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	ТекстMD = СтрСоединить(Строки, Символы.ПС);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьТабуляцию()
	Строки = СтрРазделить(ТекстMD, Символы.ПС);
	ЭтоКомментарий = Ложь;
	Для Индекс = 0 По Строки.ВГРаница() Цикл
		Строка = Строки[Индекс];
		Если СтрНачинаетсяС(Строка, "```") И НЕ СтрНайти(Строка, "```",,, 2) > 0 Тогда
			ЭтоКомментарий = НЕ ЭтоКомментарий;
		КонецЕсли;
		Если ЭтоКомментарий Тогда
			Строки[Индекс] = СтрЗаменить(Строка, Символы.Таб, "    ");
			Строки[Индекс] = СтрЗаменить(Строка, Символы.НПП, " ");
		КонецЕсли;
	КонецЦикла;
	ТекстMD = СтрСоединить(Строки, Символы.ПС);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьСсылки()
	Для Каждого Изображение Из Изображения Цикл
		Если ПустаяСтрока(Изображение.ИсходныйПуть) ИЛИ ПустаяСтрока(Изображение.Путь) Тогда
			Продолжить;
		КонецЕсли;
		ТекстMD = СтрЗаменить(ТекстMD, Изображение.ИсходныйПуть, Изображение.Путь);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВыбранныйЯзык()
	ТекстMD = СтрЗаменить(ТекстMD, "```bsl", "```onec8");
	ТекстMD = СтрЗаменить(ТекстMD, "```sdbl", "```onec8");
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция СписокИзображений()
	ТаблицаСсылок = Изображения.Выгрузить();
	МассивСтрок = ТаблицаЗначенийВМассив(ТаблицаСсылок);
	Возврат МассивСтрок;
КонецФункции

&НаКлиенте
Функция ПолучитьУровень(Заголовок)
	Уровень = 0;
	Для НомерСимвола = 2 По 5 Цикл
		Символ = Сред(Заголовок, НомерСимвола, 1);
		Если Символ <> "#" Тогда
			Уровень = НомерСимвола - 1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Уровень;
КонецФункции	

&НаКлиенте
Функция ФайлСуществует(ИмяФайла)
	Файл = Новый Файл(ИмяФайла);
    Возврат Файл.Существует();
КонецФункции

&НаКлиенте
Процедура ПрочитатьНастройки()
	ИмяФайлаНастроек = ПутьКПроекту + "\layout2is.json";
	Если ФайлСуществует(ИмяФайлаНастроек) Тогда
		Настройки = ПрочитатьДанныеИзФайлаJSON(ИмяФайлаНастроек);
		Изображения.Очистить();
		Для Каждого Изображение Из Настройки.Изображения Цикл
			ЗаполнитьЗначенияСвойств(Изображения.Добавить(), Изображение);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьТекстMD()
	ИмяФайлаТекстаMD = ПутьКПроекту + "\README.md";
	Если ФайлСуществует(ИмяФайлаТекстаMD) Тогда
		Текст = Новый ТекстовыйДокумент;
		Текст.Прочитать(ИмяФайлаТекстаMD, КодировкаТекста.UTF8);
		ТекстMD = Текст.ПолучитьТекст();
	Иначе
		ТекстMD = "Файл текста README.md в каталоге проекта НЕ НАЙДЕН!";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Прочитать()
	ПрочитатьНастройки();
	ПрочитатьТекстMD();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВладельца(ИмяФормы, Параметры = Неопределено, Владелец, Уникальность = Неопределено, Окно = Неопределено, НавигационнаяСсылка = Неопределено, ОписаниеОповещенияОЗакрытии = Неопределено, РежимОткрытияОкна = Неопределено)
	Позиция = СтрНайти(Владелец.ИмяФормы, ".", НаправлениеПоиска.СКонца);
	ПолноеИмяФормы = Лев(Владелец.ИмяФормы, Позиция) + ИмяФормы;
	ОткрытьФорму(ПолноеИмяФормы, Параметры, Владелец, Уникальность, Окно, НавигационнаяСсылка, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкна);
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьПутиСсылок(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Словарь = Новый Соответствие;
	Для Каждого Изображение Из Изображения Цикл
		Словарь[Изображение.Имя] = Изображение;
	КонецЦикла;
	НайденныеСсылки = JSONВОбъект(Результат);
	Для Каждого Ссылка Из НайденныеСсылки Цикл
		//{name, href}
		Имя = Ссылка.name;
		Изображение = Словарь[Имя];
		Если Изображение = Неопределено Тогда
			Изображение = Изображения.Добавить();
			Изображение.Имя = Имя;
			Изображение.ИсходныйПуть = "/images/" + Имя;
		КонецЕсли;
		Изображение.Путь = Ссылка.href;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьHTMLВБуферОбмена(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти