//  Подсистема "Технология верстки статьи для Infostart"
//	Автор: Калякин Андрей Г.
//  https://github.com/KalyakinAG/layout2is
//  https://infostart.ru/1c/tools/2145718/

#Область ПрограммныйИнтерфейс

// Возвращает параметры регистрации внешней обработки для подсистемы "Дополнительные отчеты и обработки"
//
// Возвращаемое значение:
//   Структура - см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке()
Функция СведенияОВнешнейОбработке() Экспорт
	Сведения = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	Сведения.Наименование = Метаданные().Синоним;
	Сведения.Версия =  "1.0.0.7";
	Сведения.Вид = "ДополнительнаяОбработка";
	Возврат Сведения;
КонецФункции

#КонецОбласти