//  Подсистема "Технология верстки статьи для Infostart"
//	Автор: Калякин Андрей Г.
//  https://github.com/KalyakinAG/layout2is
//  https://infostart.ru/1c/tools/2145718/

Функция СведенияОВнешнейОбработке() Экспорт
	
	Имя = Метаданные().Имя;
	Представление = Метаданные().Представление();
	
	Структура = Новый Структура;
	Структура.Вставить("Вид", "ДополнительнаяОбработка"); 
	Структура.Вставить("Наименование", Представление);
	Структура.Вставить("Версия", "1.0.0.1");
	Структура.Вставить("БезопасныйРежим", Ложь);
	Структура.Вставить("Информация", Метаданные().Синоним);
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Идентификатор");
	Команды.Колонки.Добавить("Представление");
	Команды.Колонки.Добавить("Модификатор");
	Команды.Колонки.Добавить("ПоказыватьОповещение");
	Команды.Колонки.Добавить("Использование");
	
	НоваяСтрока = Команды.Добавить();
	НоваяСтрока.Идентификатор = Имя;
	НоваяСтрока.Представление = Представление;
	НоваяСтрока.Модификатор   = "";
	НоваяСтрока.ПоказыватьОповещение = Ложь;
	НоваяСтрока.Использование = "ОткрытиеФормы";
	
	
	Структура.Вставить("Команды", Команды);
	
	Назначение = Новый Массив;  
	Структура.Вставить("Назначение", Назначение);
	
	Возврат Структура;
	
КонецФункции