//  Подсистема "Технология верстки статьи для Infostart"
//	Автор: Калякин Андрей Г.
//  https://github.com/KalyakinAG/layout2is
//  https://infostart.ru/1c/tools/2145718/

#Область ПрограммныйИнтерфейс

// Возвращает параметры регистрации внешней обработки для подсистемы "Дополнительные отчеты и обработки"
//
// Возвращаемое значение:
//   Структура - см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке()
Функция СведенияОВнешнейОбработке() Экспорт

	Сведения = НовыйСведенияОВнешнейОбработке();
	Сведения.Наименование = Метаданные().Синоним;
	Сведения.Версия =  "1.0.0.8";
	Сведения.БезопасныйРежим = Ложь;
	Сведения.Вид = "ДополнительнаяОбработка";
	ЗаполнитьЗначенияСвойств(Сведения.Команды.Добавить(), 
		Новый Структура("Идентификатор, Представление, Использование", 
		Метаданные().Имя, Метаданные().Представление(), "ОткрытиеФормы"));
	Возврат Сведения;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйСведенияОВнешнейОбработке(ВерсияБСП = "")
	ПараметрыРегистрации = Новый Структура;
	
	ПараметрыРегистрации.Вставить("Вид", "");
	ПараметрыРегистрации.Вставить("Версия", "0.0");
	ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование", Неопределено);
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	ПараметрыРегистрации.Вставить("Информация", Неопределено);
	ПараметрыРегистрации.Вставить("ВерсияБСП", ВерсияБСП);
	ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);
	
	ТаблицаКоманд = Новый ТаблицаЗначений;
	ТаблицаКоманд.Колонки.Добавить("Представление");
	ТаблицаКоманд.Колонки.Добавить("Идентификатор");
	ТаблицаКоманд.Колонки.Добавить("Использование");
	ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение");
	ТаблицаКоманд.Колонки.Добавить("Модификатор");
	ТаблицаКоманд.Колонки.Добавить("Скрыть");
	ТаблицаКоманд.Колонки.Добавить("ЗаменяемыеКоманды");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	ПараметрыРегистрации.Вставить("Разрешения", Новый Массив);
	
	Возврат ПараметрыРегистрации;
КонецФункции

#КонецОбласти
